Revit 2027 API
StructuralSettings.ShowBraceAbove Property
 Whether to show brace symbols above beams in plan views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowBraceAbove { get; set; }
Public Property ShowBraceAbove As Boolean
	Get
	Set
public:
property bool ShowBraceAbove {
	bool get ();
	void set (bool value);
}
member ShowBraceAbove : bool with get, set
Property Value
Boolean
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace